Documents/УП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>УП</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаУтверждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стандарт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Семестр</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Семестр</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДисУП</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дисциплина</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Дисциплина</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КолЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидАттестации</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидАттестации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УП/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ) 
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ Документ.УП
	|ГДЕ НП = &НП И Семестр = &Семестр И Стандарт = &Стандарт 
	|");     
	Запрос.УстановитьПараметр("НП", ЭтотОбъект.НП);
	Запрос.УстановитьПараметр("Семестр", ЭтотОбъект.Семестр);
	Запрос.УстановитьПараметр("Стандарт", ЭтотОбъект.Стандарт);
	
	Результат = Запрос.Выполнить().Выгрузить();
	Если Результат[0].Количество > 0 Тогда
		Сообщить("Для этого НП на этот семестр уже есть документ по этому стандарту");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
